Revit.Elements.CurveByPoints
A Revit Curve By Points

Revit.Elements.CurveByPoints.#ctor(Autodesk.Revit.DB.CurveByPoints)
Construct a model curve from the document.  The result is Dynamo owned
curveByPoints:

Revit.Elements.CurveByPoints.InitCurveByPoints(Autodesk.Revit.DB.CurveByPoints)
curveByPoints:

Revit.Elements.CurveByPoints.ByReferencePoints(Revit.Elements.ReferencePoint[],System.Boolean)
Construct a Revit CurveByPoints Element (a CurveElement) from a collection of ReferencePoint's
points:
isReferenceLine:
Returns:

Revit.Elements.CurveByPoints.FromExisting(Autodesk.Revit.DB.CurveByPoints,System.Boolean)
Construct a Revit ModelCurve element from an existing element.
curveByPoints:
isRevitOwned:
Returns: